"""
@Project ：python 
@Author : 文跃锐（yuerwen）
@Time   : 2021/09/26
@File   :yuerwen_指定格式字符串显示时间_2.py
"""
from datetime import datetime
import time
# 以指定格式字符串显示时间，是非常常用的，比如日志里面的时间戳。
# 要得到 当前时间 对应的字符串，可以这样实现：
print(datetime.now())  # datetime.datetime(2021, 9, 26, 22, 31, 8, 202105)
print(str(datetime.now()).split('.')[0])  # 2021-09-26 22:32:49


'''
python中时间日期格式化符号：

%y 两位数的年份表示（00-99）
%Y 四位数的年份表示（000-9999）
%m 月份（01-12）
%d 月内中的一天（0-31）
%H 24小时制小时数（0-23）
%I 12小时制小时数（01-12）
%M 分钟数（00=59）
%S 秒（00-59）
%a 本地简化星期名称
%A 本地完整星期名称
%b 本地简化的月份名称
%B 本地完整的月份名称
%c 本地相应的日期表示和时间表示
%j 年内的一天（001-366）
%p 本地A.M.或P.M.的等价符
%U 一年中的星期数（00-53）星期天为星期的开始
%w 星期（0-6），星期天为星期的开始
%W 一年中的星期数（00-53）星期一为星期的开始
%x 本地相应的日期表示
%X 本地相应的时间表示
%Z 当前时区的名称
%% %号本身
'''
# 如果要指定输出的时间格式，可以像下面这样
print(datetime.now().strftime('%Y-%m-%d %H:%M:%S'))
# time.localtime() 没有参数就代表获取是当前的时间。参数就是指指定时间的秒数
print(time.strftime('%Y_%m_%d %H:%M:%S',time.localtime(1434502529)))  # 2015_06_17 08:55:29

# 字符串时间转化为整数时间
# 反过来，如果要将字符串指定的时间，转化为秒数时间，可以这样
f = int(time.mktime(time.strptime('2020-9-4 23:59:59','%Y-%m-%d %H:%M:%S')))
print(f)