"""
@Author : 文跃锐（yuerwen）
@Time   : 2021/08/07
@File   :test10_03lx.py
"""
'''
第一题：
有如下的代码
str1 = '大家好，我的名字叫：'
str2 = '黑羽白月'
请接下来写一行代码，用字符串格式化的方式 将 str1 和 str2 拼接成一个字符串。
'''
str1 = '大家好，我的名字叫：'
str2 = '黑羽白月'
print(str1+str2)
print('%s%s'%(str1,str2))
print(f'{str1}{str2}')
print('{}{}'.format(str1,str2))


'''
第二题：
请写一段代码，运行的时候，提示用户 输入你的名字

在用户输入名字后，再提示用户 输入你的年龄

在用户输入后，显示

你的名字是：xxxx， 你的年龄是yy
其中xxxx是刚才用户输入的名字 yy是刚才用户输入的年龄
'''
name = input('输入你的名字:')
age = input('输入你的年龄:')
# 使用 f-string 的风格进行字符串格式化
print(f'你的名字是：{name}，你的年龄是{age}')

'''
第三题：
下面的 列表中保存了 游戏系统里面的 用户信息

info = [
    ['user1', 345.6, 12, '黄金'],
    ['user2', 2345.6, 8, '白银'],
    ['user3555', 55345.6, 22, '钻石'],
]
每个元素也是一个列表， 对应一个用户的信息。

其中， 元素1 是用户的姓名， 元素2 是用户的积分，元素3是用户的等级，元素4是用户的头衔。

请写代码 根据上面的列表，以下面的格式打印用户的信息到屏幕上。

用户：   user1， 积分：  345.6， 等级：12， 头衔：黄金
用户：   user2， 积分： 2345.6， 等级： 8， 头衔：白银
用户：user3555， 积分：55345.6， 等级：12， 头衔：钻石
注意，使用适当的格式化方式， 使输出像上面那样对齐
'''
info = [
    ['user1', 345.6, 12, '黄金'],
    ['user2', 2345.6, 8, '白银'],
    ['user3555', 55345.6, 22, '钻石'],
]
# 左对齐
# 注意字符串默认是左对齐的
print(f'用户：{info[0][0]:10}， 积分：{info[0][1]:<8}， 等级：{info[0][2]:<4}， 头衔：{info[0][3]:4}')
print(f'用户：{info[1][0]:10}， 积分：{info[1][1]:<8}， 等级：{info[1][2]:<4}， 头衔：{info[1][3]:4}')
print(f'用户：{info[2][0]:10}， 积分：{info[2][1]:<8}， 等级：{info[2][2]:<4}， 头衔：{info[2][3]:4}')

# 右对齐
print(f'用户：{info[0][0]:>10}， 积分：{info[0][1]:>8}， 等级：{info[0][2]:>4}， 头衔：{info[0][3]}')
print(f'用户：{info[1][0]:>10}， 积分：{info[1][1]:>8}， 等级：{info[1][2]:>4}， 头衔：{info[1][3]}')
print(f'用户：{info[2][0]:>10}， 积分：{info[2][1]:>8}， 等级：{info[2][2]:>4}， 头衔：{info[2][3]}')